[
  {
      "recipe_name": "Horn and Hardart's Baked Macaroni And Cheese",
      "recipe_ingredients": "1/4 lb Elbow macaroni|1 1/2 tb Butter|1 1/2 tb Flour|1/2 ts Salt|1 ds White pepper|1 ds Red pepper|1 1/2 c Milk|2 tb Light cream|1 c Cheddar cheese; shredded|1/4 c Canned tomatoes; diced|1/2 ts Sugar",
      "recipe_servings": "1",
      "recipe_instructions": "Cook macaroni according to package directions. Preheat oven to 400. Melt butter in the top of a double boiler. Gradually blend in flour, salt and white and red pepper until smooth. Add milk and cream, stirring constantly. Cook for a few minutes until mixture thickens. Add cheese and continue to heat until cheese is melted and sauce looks smooth. Remove from heat and add macaroni. Add sugar to tomatoes and add to macaroni. Pour mixture into a buttered baking dish and bake until surface browns. NOTES : CTLINDA",
      "recipe_intake": 1,
      "active": true,
      "user_id": null
  },
  {
    "recipe_name": "Grandma Lee's Hoisin Chicken Pizza",
    "recipe_ingredients": "2 c Sliced scallions; save 2 tbspns|For garnish|2 c Diced dark chicken meat|1/4 c Hoisin sauce|1 tb Minced ginger|1 tb Sambal oelek|2 c Grated mozzarella|Salt; to taste|Freshly-ground black pepper; to taste|1/3 Pizza Dough recipe;",
    "recipe_servings":"1",
    "recipe_instructions":"Note: See the \"Pizza Dough\" recipe which is included in this collection. In a bowl, mix scallions, chicken, hoisin, ginger and sambal. Season with salt and pepper. Top raw pies with mix then top with cheese. Bake at 375 degrees for 15 minutes. (Because of the raw chicken, we bake it for longer at a lower temperature. Make sure the chicken is fully cooked.) Garnish with scallions. This recipe yields two 8- to 10-inch pizzas.",
    "recipe_intake": 2,
    "active": true,
    "user_id": null
  },
  {
    "recipe_name": "Jenny's Creole Hamburgers",
    "recipe_ingredients": "1 lb Ground meat|1/2 Onion, chopped|1/2 Bell pepper, chopped|1 cn Chicken gumbo soup|1/2 cn Water|2 tb Catsup|1 tb Prepared mustard",
    "recipe_servings":"6",
    "recipe_instructions":"Scramble meat and brown with onions and bell peppers, drain. Add remaining ingredients. Simmer until thickened. Serve on large hamburger buns.",
    "recipe_intake": 2,
    "active": true,
    "user_id": null
  },
  {
    "recipe_name": "Hooter's Hot Dogs",
    "recipe_ingredients": "1 pk Hot Dogs|1 Loaf Frozen Bread Dough",
    "recipe_servings":"1",
    "recipe_instructions":"1. Let frozen bread thaw and rise. 2. Cut off pieces of dough, roll out and wrap around hot dogs. 3. Make sure hot dog is well sealed. 4. Let rise 15 minutes and pop in a 350 degree oven for 20 to 25 minutes.",
    "recipe_intake": 1,
    "active": true,
    "user_id": null
  },
  {
      "recipe_id": "b1da5f72-8e3a-40ba-8a3d-89cdbfb7474c",
      "recipe_name": "Crunchy Chicken Nuggets",
      "recipe_ingredients": "1/3 c Plus|2 ts Unsweetened wheat germ|1 ts Paprika|1/2 ts Coarsely ground black pepper|1/4 ts Salt|15 oz Skinless boneless chicken breasts; cut into bite-sizes|2 ts Vegetable oil",
      "recipe_servings": "4",
      "recipe_instructions": "In large nonstick skillet, heat oil; add coated chicken pieces. Cook, turning as needed, 10-12 minutes, until golden brown on all sides and cooked through. EACH SERVING PROVIDES: 1/2 fat; 3 proteins; 1/2 bread PER SERVING: 180 calories; 28g protein; 5g fat; 6g carbohydrate; 20mg calcium; 205mg sodium; 62 mg cholesterol; 1 g dietary fiber RECIPEINTERNET LIST SERVER",
      "recipe_intake": 2,
      "active": true,
      "user_id": null
  },
  {
    "recipe_name": "Soto Banjar Indonesian Chicken Noodle Soup",
    "recipe_ingredients": "4 c Defatted chicken broth|3 c Water|4 lg Flat-leaf parsley sprigs|2 Fresh cilantro sprigs; roots and stems slightly crushed|1 Whole chicken breast (1 to 1 1/4 lbs.); rinsed|3 md Boiling potatoes (about 12 oz.); peeled and cut into 1/2-inch cubes|4 oz Shallots; peeled|4 lg Cloves garlic; peeled|3 tb Olive oil|1 tb Peeled fresh ginger; minced|1 ts Ground cardamom|1 Cinnamon stick; (3 inches long)|Coarse salt and freshly ground black peppe; to taste|2 c Cooked angel hair pasta|3 Hard-cooked eggs; peeled and quartered|1/4 c Chopped green celery|Leaves or fresh cilantro leaves|1 Lime; thinly sliced",
    "recipe_servings":"1",
    "recipe_instructions":"Combine the chicken broth, water, and parsley and cilantro sprigs in a medium-size soup pot. Bring to a boil and add the chicken breast. Reduce the heat and simmer, partially covered, until the chicken is just cooked through, about 30 minutes. Remove the chicken and let cool slightly. Shred the meat from the bones in 1 1/2 x 1/2-inch pieces, discarding the skin and bones. Set aside covered. Strain the broth and return it to the pot. Add the potatoes to the broth. Cut half the shallots and half the garlic lengthwise into very thin slices. Heat the oil in a medium-size nonstick skillet over low heat. Add the sliced shallots and garlic and cook, stirring, until lightly golden and crisp, about 10 minutes. Remove with a slotted spoon to a paper towel to drain. Reserve for garnish. Finely mince the remaining shallots and garlic and the ginger together with the cardamom. Add to skillet and cook uncovered, stirring, over low heat until aromatic, 3 to 4 minutes. Add this mixture to the broth along with the cinnamon stick, salt, and pepper. Cook covered over medium heat until the potatoes are tender, 12 to 15 minutes. Remove the potatoes from the broth with a slotted spoon. To assemble, lay out 4 to 6 shallow soup or pasta bowls. Arrange the chicken, pasta, eggs, and potatoes in sections in each bowl, so that it resembles 4 wedges. Heat the broth until piping hot and adjust the seasonings. Discard the cinnamon stick. Ladle the broth into the bowls and sprinkle with the reserved shallots and garlic. Sprinkle the celery leaves or cilantro atop and float a lime slice in the center of each bowl. Serves 6 as a first course, 4 as an entree.",
    "recipe_intake": null,
    "active": true,
    "user_id": null
  },
  {
    "recipe_name": "Grilled Cheese Savory with Anchovies And Garlic",
    "recipe_ingredients": "2 Shallots|1 Fat clove garlic|7 g Unsalted butter; (1/4oz)|2 Eggs|2 tb Double cream|1 tb Whole grain mustard|180 g Mature chedder cheese; (6oz)|4 sm Bread rolls|12 Marinated anchovy fillets|4 Black olives|4 Sprigs parsley",
    "recipe_servings": "1",
    "recipe_instructions":"Peel and finely chop shallots. Peel and crush garlic. Melt butter in a small pan, add shallots and garlic and cook slowly to soften. Do not allow vegetables to colour. Beat eggs and cream together with a fork in a small bowl. Grate cheese. Add egg mixture to pan off heat and stir in mustard and grated cheese. Continue stirring until thoroughly mixed. Cook over low heat, stirring constantly until mixture thickens and amalgamates. Treat it as you would lightly scrambled egg. Remove from heat, tip into bowl and allow to cool. Preheat grill. Split rolls and toast. Pile the cheese savoury onto the cut surfaces and toast again until golden and puffed up. Slice anchovies in half lengthways. Cut olives in half and remove stones. Top savouries with anchovies and olives. Return to grill to warm, garnish then decorate with sprigs of parsley and serve immediately. Per serving: 302 Calories (kcal); 18g Total Fat; (50% calories from fat); 19g Protein; 21g Carbohydrate; 389mg Cholesterol; 402mg Sodium Food Exchanges: 0 Grain(Starch); 1 1/2 Lean Meat; 3 1/2 Vegetable; 0 Fruit; 2 1/2 Fat; 0 Other Carbohydrates",
    "recipe_intake": 1,
    "active": true,
    "user_id": null
  },
  {
    "recipe_name": "Grandma's Spaghetti Gravy",
    "recipe_ingredients": "1 lb Italian sausage; cut up *|1 lb Short ribs; cut up|2 tb Olive oil; optional|1 lb Italian meatballs|6 Cloves garlic; crushed|1/2 c Tomato paste; homemade, if poss.|6 lb Fresh tomatoes; peeled/seeded/diced|1 sm Maui onion; chopped fine|1 sm Green pepper; chopped fine|1 bn Italian parsley; fresh, chopped|1 bn Sweet basil; freshly chopped|2 tb Fresh oregano|Salt and pepper; to taste|1 ts Red pepper flakes; crushed|1/2 lb Fresh mushrooms; sliced, optional|1 ts Sugar|1/4 c Parmesan cheese; freshly grated|Meatballs|1 lb Ground beef|1 lg Clov garlic; minced|2 lg Eggs|1 c Italian bread crumbs|1 tb Parmesan cheese; freshly grated|Italian parsley; fresh, chopped",
    "recipe_servings": "6",
    "recipe_instructions":"See recipe for Grandma's Italian Sausage In a large heavy pot brown the sausage over a medium heat. Remove and add the short ribs. Brown the ribs. Remove. If necessary, add a couple of tablespoons of olive oil and brown the meatballs OR you can brown them in the oven together with the sausage and ribs. Remove the meatballs and add the garlic and tomato paste to the pan drippings. Cook until the drippings are absorbed. Adjust the tomato paste and drippings until they are well combined. (Add extra tomato paste or remove some of the drippings.) Add the fresh tomatoes, onions, green pepper, parsley, sweet basil, oregano, red pepper and salt and freshly ground black pepper to taste. Bring to a boil. Add the sausage, ribs and meatballs. Reduce heat and simmer over a VERY LOW heat for two or three hours. Adjust seasonings. About 1/2 hour before cooking is finished add sliced mushrooms, sugar and Parmesan cheese. This is a very rich spaghetti sauce and sooo delicious, you may never want to at any other spaghetti sauce again. If you're lucky enough to have a little sauce left over, it's great for pizza. MEATBALLS Combine the ground beef, garlic, eggs, Italian bread crumbs, Parmesan cheese and Italian parsley. Form into meat balls. Fry them in the drippings from the sausage and ribs, or if there aren't enough drippings, add a little olive oil, browning on all sides.",
    "recipe_intake": 1,
    "active": true,
    "user_id": null
  },
  {
    "recipe_name": "Beef Tacos",
    "recipe_ingredients": "1 lb Lean Ground Beef|1 pk Taco Seasoning Mix|2 c Sharp Cheddar Cheese; grated|2 Tomatoes; chopped|1 Or 2 cups Lettuce; shredded|1 md Onion; diced|12 Corn Tortillas; soft or hard|Sour Cream and Salsa; (optional garnishes)",
    "recipe_servings": "6",
    "recipe_instructions":"Brown the ground beef in a skillet over medium heat setting. If desired, add half the onions now and brown with the ground beef. Drain any excess fat and add the taco seasoning mix, making sure to blend well. To prepare and serve the tacos, simply place a layer of the meat in the bottom of the tortilla, cover with a layer of cheese, a few diced tomatoes, lettuce, and raw diced onion as desired. Serve with optional garnishes or enjoy as is. Kitchen Staff Tip: Looking for a Chili Con Queso that's easy to prepare and serve? Try sautéing about 1/2 cup of minced onions with 1/4 cup butter in a skillet over medium heat. Stir in 1 cup of chopped tomatoes, 4-ounces of green chilies and about 1/2 teaspoon of salt. Simmer the mixture for about 15 minutes, then start adding 1/2 pound of cubed cheddar cheese to the mixture a few pieces at a time, melting and stirring as you go. Pour the prepared queso into a chafing dish or fondue pot to keep warm while serving with plain tortilla chips. You can add a little milk to the mixture if it's too thick. Dip the chips and enjoy.",
    "recipe_intake": 1,
    "active": true,
    "user_id": null
  },
  {
    "recipe_name": "Mike Douglas' Chicken Parmigiana",
    "recipe_ingredients": "3 1/2 lb Chicken; cut into pieces|1 c Mushrooms; sliced|1 Green pepper; core; seed, finely chopped|1/2 c Onion; finely chopped|1 Garlic clove; finely minced|2 c Tomatoes; peel; seed, chop|1/2 c Dry vermouth|1/2 c Stuffed olives; sliced|4 tb Fresh grated parmesan cheese|4 tb Butter or olive oil",
    "recipe_servings": "4",
    "recipe_instructions":"Preheat the oven to 350F. Sprinkle the chicken with salt and pepper and brown on all sides in the butter. Sprinkle with the mushrooms and cook for 5 minutes. Add the green pepper, onions, garlic, tomatoes, and vermouth. Cover tightly and bake for 30 minutes. Add the olives and cook for 10 minutes longer. Serve with grated cheese. Per serving: 666 Calories (kcal); 45g Total Fat; (64% calories from fat); 50g Protein; 5g Carbohydrate; 261mg Cholesterol; 207mg Sodium Food Exchanges: 0 Grain(Starch); 7 Lean Meat; 1/2 Vegetable; 0 Fruit; 4 1/2 Fat; 0 Other Carbohydrates",
    "recipe_intake": 1,
    "active": true,
    "user_id": null
  },
  {
    "recipe_name": "Salmon Sushi",
    "recipe_ingredients": "2 1/4 Parts vinegar|2 Parts salt",
    "recipe_servings": "4",
    "recipe_instructions":"Filet out the he middle portion from back to front. Marinate for one day in a mixture of salt and 5% vinegar until the surface of the fish is \"cooked\" (like seviche). Freeze overnight and then slice thin and serve. I didn't get the proportions of salt and vinegar but I am assuming that it is very similar to what I use for pickling fish.",
    "recipe_intake": 1,
    "active": true,
    "user_id": null
  },
  {
    "recipe_name": "Chiffonade of Lobster",
    "recipe_ingredients": "2 c Lobster meat|1 Egg yolk|1 tb White wine vinegar|1 tb Dijon or Dusseldorf mustard|1 tb Tomato paste|1 ds Salt and pepper, to taste|1/8 ts Cayenne or tabasco|1 c Salad oil|1/2 Lemon|3/4 ts Tarragon; freshly chopped OR|1/4 t dried tarragon|2 tb Cognac|3/4 c Tomato; seeded and cubed|12 Romaine lettuce leaves",
    "recipe_servings": "6",
    "recipe_instructions":"Chop or shread the cooked lobster meat and refrigerate until dressing has been prepared. For the dressing, place the yolk in a mixing bowl and add vinegar, mustard, tomato paste, salt and pepper and cayenne. Gradually add the oil, beating vigorously with a wire whisk. Juice the lemon. Beat in the lemon juice, tarragon and cognac. Add lobster and tomatoes to the dressing and fold in with a rubber spatula. This may be done in advance and refrigerated for an hour or so. Prepare the salad: When ready to serve, stack crisped romaine lettuce leaves and slice them into fine shreads. Place shreads on individual salad plates. Top with lobster dressing and serve immediately. (You may substitute crabmeat or shrimp for the lobster.) A Craig Claiborne recipe.",
    "recipe_intake": 1,
    "active": true,
    "user_id": null
  },
  {
    "recipe_name": "Deviled Eggs on Toast with Caviar",
    "recipe_ingredients": "6 sl White bread|6 Hard-boiled eggs|1/4 c Creme fraiche|2 tb Heavy cream|Coarse salt|Freshly ground pepper|1/2 oz Osetra caviar|8 Chives; cut 1 1/2\" lengths",
    "recipe_servings": "24",
    "recipe_instructions":"Heat oven to 400 degrees. Remove crust from bread and cut bread into quarters. Spread bread squares evenly on a baking pan. Bake until edges are lightly golden, 7 to 10 minutes, and set aside to cool. Peel the eggs, and cut in half lengthwise. Carefully scoop out the yolks, and reserve. Cut whites in half again lengthwise, and arrange quarters on toast squares at a diagonal. Using a stiff rubber spatula, push the yolks through a fine mesh sieve placed over a small bowl. Stir in creme fraiche, heavy cream, salt, and pepper. Transfer yolk mixture into a medium size pastry bag fitted with an open-star tip (Wilton #32). Pipe mixture into egg-white quarters, about 3/4 teaspoon for each quarter. Spoon a dab of caviar over piped yolks, and garnish with a chive. Makes 24. Per serving: 47 Calories (kcal); 3g Total Fat; (52% calories from fat); 2g Protein; 3g Carbohydrate; 57mg Cholesterol; 51mg Sodium Food Exchanges: 0 Grain(Starch); 0 Lean Meat; 0 Vegetable; 0 Fruit; 1/2 Fat; 0 Other Carbohydrates",
    "recipe_intake": 1,
    "active": true,
    "user_id": null
  },
  {
    "recipe_name": "Pine Nut-Almond Macaroons",
    "recipe_ingredients": "1/4 c Marsala|3 tb Dried currants|3/4 c Toasted slivered almonds|1/2 c Toasted pine nuts|2/3 c Sugar|1 tb All purpose flour|1 lg Egg white|1/8 ts Almond extract; (generous)|1 c Pine nuts; (about 4 1/2 ounces)",
    "recipe_servings": "1",
    "recipe_instructions":"Preheat oven to 350F. Line large cookie sheet with foil. Combine Marsala and currants in heavy small saucepan. Cook over medium heat until liquid evaporates, about 5 minutes. Cool. Finely grind almonds and 1/2 cup toasted pine nuts with sugar and flour in processor. Mix egg white with extract in medium bowl. Add to processor and blend until dough forms ball. Place dough in bowl. Mix in currants. Shape dough between palms into 3/4-inch-diameter balls. Roll in 1 cup pine nuts to cover, pressing to adhere. Flatten each to 1 1/2-inch round. Space evenly on cookie sheet. Bake until golden brown about 15 minutes. Cool slightly. Remove cookies from foil using metal spatula and cool on rack. (Can be prepared 4 days ahead. Store in airtight container at room temperature.) Makes about 22.",
    "recipe_intake": 1,
    "active": true,
    "user_id": null
  },
  {
    "recipe_name": "Chestnut Icecream",
    "recipe_ingredients": "300 ml Cream|300 ml Milk|4 Egg yolks|1/2 c Sugar|Vanilla essence or rum for flavour (use the rum)|1 cn (16-oz) sweetened chestnut puree (note the puree has vanilla added to it already)|Garnish: marron glace; chopped finely",
    "recipe_servings": "8",
    "recipe_instructions":"from \"Grand Finales\" by Vogue Australia: Bring the cream and milk to the boil in a saucepan. Beat the egg yolks with the sugar. Pour some of the heated cream and milk onto the eggs and whisk. Pour mixture back into the remaining heated cream. Cook over a low heat, stirring constantly, until the custard coats the back of a spoon. Strain into a bowl and leave to cool. Add the chestnut puree and beat it well into the custard. Flavour to taste with vanilla or a little rum. Chill in the refrigerator for 1-2 hours. Freeze in an ice-cream maker (or use th old method of beating it every half hour several times). Serve garnished with chopped marron glace. Serves 8. My note: Chestnuts go well with chocolate; serve this with chocolate sauce and some chocolate curls to decorate too; superb for a special occasion. Also go easy on the rum, freezing intensifies the flavours and alcohol is an anti-freeze, a little goes a long way, 2 tablespoons should be more than enough. /MISC",
    "recipe_intake": 1,
    "active": true,
    "user_id": null
  },
  {
    "recipe_name": "Elegant Tuna Casserole",
    "recipe_ingredients": "3 tb Butter or margarine|4 Green onions; chopped, Plus tops|1 c Fresh mushrooms; sliced|1 tb Parsley; chopped|1 cn Cream of mushroom soup|1/2 c Dry white wine|1/4 c Shredded jack cheese|2 cn (7 Oz) Tuna;, Drained|2 tb Parmesan cheese|1/2 c Crushed tortilla chips",
    "recipe_servings": "6",
    "recipe_instructions":"Place butter, onions, mushrooms and parsley in a 2 quart casserole. Cover. Microwave at high (100%) until onions are tender crisp, 2 to 3 minutes. Add remaining ingredients, except Parmesan cheese and tortilla chips. Microwave at medium high (70%) until hot and bubbly, 8 to 10 minutes. Sprinkle cheese and chips over top. Microwave at medium high (70%) until heated, 1 to 2 minutes. Makes 6 servings.",
    "recipe_intake": 1,
    "active": true,
    "user_id": null
  },
  {
    "recipe_name": "Jerry Springer's Mashed Potato Meatloaf",
    "recipe_ingredients": "1 lb Boiling potatoes; peeled and cut into 1-inch cubes|2 tb Butter|1/4 c Milk|2 Eggs|1 1/4 ts Salt|1 lb Ground round|1 lb Ground veal|1 Finely diced onion|2 Finely chopped garlic cloves|1/2 ts Pepper|1/4 c Grated Parmesean cheese|1 ts Paprika",
    "recipe_servings": "1",
    "recipe_instructions":"1. In a large pot, cook, drain and rinse potatoes. Mix with butter, salt, milk and eggs. 2. Mix meats, onion, garlic and pepper in bowl. 3. Combine with 3/4 of mashed potatoes and pack into a 9\"x5\"x2-1/2\" loaf pan. Bake at 350 degrees for 40 minutes.",
    "recipe_intake": 1,
    "active": true,
    "user_id": null
  },
  {
    "recipe_name": "Crockpot Sweet and Sour Pork",
    "recipe_ingredients": "2 lb Cubed pork|3 tb Soy sauce|1/4 c Vinegar|1 sm Onion; sliced|2 Tomato; cut in slices|2 tb Cornstarch|1/4 ts Ginger|1/4 c Brown sugar|2 Green peppers; cut in|Strips",
    "recipe_servings": "1",
    "recipe_instructions":"In slow cooker mix pork with cornstarch. Then mix in remaining ingredients except green pepper & tomatoes. Cook on low for 8 hours. Stir in green pepper & tomatoes. Cook on high for 10 minutes.",
    "recipe_intake": 1,
    "active": true,
    "user_id": null
  }]
  